"""
Пользователь вводит две буквы.
Определить, на каких местах алфавита они стоят и сколько между ними находится букв.
"""

alphabet = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l",
            "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x",
            "y", "z"]

alp_1 = input('Введите первую букву: ')
alp_2 = input("Введите вторую букву: ")

alp_1 = alphabet.index(alp_1)
alp_1 += 1
print(f"Первая буква стоит = {alp_1}")
alp_2 = alphabet.index(alp_2)
alp_2 += 1
print(f"Вторая буква стоит = {alp_2}")
res = alp_2 - alp_1 - 1
print(f"Между ними находится {res} букв")
